using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Manager : MonoBehaviour {
    //==========================================================================

    //==========================================================================
    //コンポーネント

    //==========================================================================
    //コンポーネント参照
    private void CRef () {
    }

    //==========================================================================
    //初期化
    private void Init () {
        CRef();
    }

    //==========================================================================
    private void Awake () {
        Init();
    }

    private void Start () {
    }

    private void Update () {
    }
}